regimantas/Arduino-PY32/boards.txt
GenF003.menu.BOR.unchanged=Unchanged
GenF003.menu.BOR.unchanged.build.bor_flags=
GenF003.menu.BOR.disabled=Disabled
GenF003.menu.BOR.disabled.build.bor_flags=-DPY32_BOR_CONFIG=0
GenF003.menu.BOR.bor17=1.7-1.8V
GenF003.menu.BOR.bor17.build.bor_flags=-DPY32_BOR_CONFIG=1
GenF003.menu.BOR.bor19=1.9-2.0V
GenF003.menu.BOR.bor19.build.bor_flags=-DPY32_BOR_CONFIG=2
GenF003.menu.BOR.bor21=2.1-2.2V
GenF003.menu.BOR.bor21.build.bor_flags=-DPY32_BOR_CONFIG=3
GenF003.menu.BOR.bor23=2.3-2.4V
GenF003.menu.BOR.bor23.build.bor_flags=-DPY32_BOR_CONFIG=4
GenF003.menu.BOR.bor25=2.5-2.6V
GenF003.menu.BOR.bor25.build.bor_flags=-DPY32_BOR_CONFIG=5
GenF003.menu.BOR.bor27=2.7-2.8V
GenF003.menu.BOR.bor27.build.bor_flags=-DPY32_BOR_CONFIG=6
GenF003.menu.BOR.bor29=2.9-3.0V
GenF003.menu.BOR.bor29.build.bor_flags=-DPY32_BOR_CONFIG=7
GenF003.menu.BOR.bor31=3.1-3.2V
GenF003.menu.BOR.bor31.build.bor_flags=-DPY32_BOR_CONFIG=8

GenF003.menu.BORWrite.skip=Do not write option bytes
GenF003.menu.BORWrite.skip.build.bor_apply_flags=
GenF003.menu.BORWrite.apply=Apply selected BOR at startup
GenF003.menu.BORWrite.apply.build.bor_apply_flags=-DPY32_APPLY_BOR_OPTION_BYTES=1

# boot
GenF003.menu.BootConnection.defaule=default isp circuit
GenF003.menu.BootConnection.defaule.upload.boot=default_reset
GenF003.menu.BootConnection.direct=direct connect
GenF003.menu.BootConnection.direct.upload.boot=direct_connect

GenF003.build.extra_flags={build.temp} -DF_CPU={build.f_cpu} {build.lsc_temp} {build.sv_tmp} {build.bor_flags} {build.bor_apply_flags}

GenF003.menu.pnum.PY32F003x4=PY32F003x4
GenF003.menu.pnum.PY32F003x4.upload.maximum_size=16384
GenF003.menu.pnum.PY32F003x4.upload.maximum_data_size=2048
GenF003.menu.pnum.PY32F003x4.build.board=PY32F003x4
GenF003.menu.pnum.PY32F003x4.build.product_line=PY32F003x4
GenF003.menu.pnum.PY32F003x4.build.variant=PY32F003xx/PY32F003_Base

GenF003.menu.pnum.PY32F003x6=PY32F003x6
GenF003.menu.pnum.PY32F003x6.upload.maximum_size=32768
GenF003.menu.pnum.PY32F003x6.upload.maximum_data_size=4096
GenF003.menu.pnum.PY32F003x6.build.board=PY32F003x6
GenF003.menu.pnum.PY32F003x6.build.product_line=PY32F003x6
GenF003.menu.pnum.PY32F003x6.build.variant=PY32F003xx/PY32F003_Base

GenF003.menu.pnum.PY32F003x8=PY32F003x8
GenF003.menu.pnum.PY32F003x8.upload.maximum_size=65536
GenF003.menu.pnum.PY32F003x8.upload.maximum_data_size=8192
GenF003.menu.pnum.PY32F003x8.build.board=PY32F003x8
GenF003.menu.pnum.PY32F003x8.build.product_line=PY32F003x8
GenF003.menu.pnum.PY32F003x8.build.variant=PY32F003xx/PY32F003_Base

###############################
# Generic PY32F002A Series
###############################

GenF002A.name=Generic PY32F002A Series

GenF002A.upload.maximum_size=0
GenF002A.upload.maximum_data_size=0

GenF002A.upload.tool=ArduinoPY32Flasher
GenF002A.upload.tool.default=ArduinoPY32Flasher

GenF002A.menu.upload_method.flasher=ArduinoPY32Flasher (Windows/Linux)
GenF002A.menu.upload_method.flasher.upload.tool=ArduinoPY32Flasher
GenF002A.menu.upload_method.flasher.upload.tool.default=ArduinoPY32Flasher
GenF002A.menu.upload_method.airisp=AirISP (serial)
GenF002A.menu.upload_method.airisp.upload.tool=AirISP
GenF002A.menu.upload_method.airisp.upload.tool.default=AirISP

GenF002A.build.core=arduino
GenF002A.build.board=GenF002A
GenF002A.build.mcu=cortex-m0plus
GenF002A.build.series=PY32F0xx
GenF002A.build.cmsis_lib_gcc=arm_cortexM0l_math
GenF002A.build.py_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenF002A.build.drivers_include="-I{build.system.path}/Arduino-PY32F0xx-Drivers/{build.series}_HAL_Driver/Inc" "-I{build.system.path}/Arduino-PY32F0xx-Drivers/{build.series}_HAL_Driver/Src" "-I{build.system.path}/{build.series}" "-I{build.system.path}/Arduino-PY32F0xx-Drivers/CMSIS/Device/{build.series}/Include/" "-I{build.system.path}/Arduino-PY32F0xx-Drivers/CMSIS/Device/{build.series}/Source/gcc/" 

GenF002A.menu.UploadSpeed.115200=115200
GenF002A.menu.UploadSpeed.115200.upload.speed=115200
GenF002A.menu.UploadSpeed.57600=57600
GenF002A.menu.UploadSpeed.57600.upload.speed=57600
GenF002A.menu.UploadSpeed.38400=38400
GenF002A.menu.UploadSpeed.38400.upload.speed=38400
GenF002A.menu.UploadSpeed.19200=19200
GenF002A.menu.UploadSpeed.19200.upload.speed=19200
GenF002A.menu.UploadSpeed.9600=9600
GenF002A.menu.UploadSpeed.9600.upload.speed=9600
GenF002A.menu.UploadSpeed.4800=4800
GenF002A.menu.UploadSpeed.4800.upload.speed=4800
GenF002A.menu.UploadSpeed.2400=2400
GenF002A.menu.UploadSpeed.2400.upload.speed=2400
GenF002A.menu.UploadSpeed.1200=1200
GenF002A.menu.UploadSpeed.1200.upload.speed=1200

# HSI/HSE选择和主频
GenF002A.menu.ClockSourceAndFrequency.HSI8M_HCLK8M=HSI 8Mhz, HCLK 8Mhz
GenF002A.menu.ClockSourceAndFrequency.HSI8M_HCLK8M.build.temp=-D{build.series}_HSI_8M_HCLK_8M
GenF002A.menu.ClockSourceAndFrequency.HSI8M_HCLK8M.build.f_cpu=8000000L

GenF002A.menu.ClockSourceAndFrequency.HSI24M_HCLK24M=HSI 24Mhz, HCLK 24Mhz
GenF002A.menu.ClockSourceAndFrequency.HSI24M_HCLK24M.build.temp=-D{build.series}_HSI_24M_HCLK_24M
GenF002A.menu.ClockSourceAndFrequency.HSI24M_HCLK24M.build.f_cpu=24000000L

GenF002A.menu.ClockSourceAndFrequency.HSE8M_HCLK8M=HSE 8Mhz, HCLK 8Mhz
GenF002A.menu.ClockSourceAndFrequency.HSE8M_HCLK8M.build.temp=-D{build.series}_HSE_8M_HCLK_8M
GenF002A.menu.ClockSourceAndFrequency.HSE8M_HCLK8M.build.f_cpu=8000000L

GenF002A.menu.ClockSourceAndFrequency.HSE16M_HCLK16M=HSE 16Mhz, HCLK 16Mhz
GenF002A.menu.ClockSourceAndFrequency.HSE16M_HCLK16M.build.temp=-D{build.series}_HSE_16M_HCLK_16M
GenF002A.menu.ClockSourceAndFrequency.HSE16M_HCLK16M.build.f_cpu=16000000L

GenF002A.menu.ClockSourceAndFrequency.HSE24M_HCLK24M=HSE 24Mhz, HCLK 24Mhz
GenF002A.menu.ClockSourceAndFrequency.HSE24M_HCLK24M.build.temp=-D{build.series}_HSE_24M_HCLK_24M
GenF002A.menu.ClockSourceAndFrequency.HSE24M_HCLK24M.build.f_cpu=24000000L

GenF002A.menu.LowSpeedClockSource.LSI=LSI 32.768Khz
GenF002A.menu.LowSpeedClockSource.LSI.build.lsc_temp=-D{build.series}_LSC_LSI

GenF002A.menu.LowSpeedClockSource.LSE=LSE 32.768Khz
GenF002A.menu.LowSpeedClockSource.LSE.build.lsc_temp=-D{build.series}_LSC_LSE

GenF002A.menu.LowSpeedClockSource.None=None
GenF002A.menu.LowSpeedClockSource.None.build.lsc_temp=-D{build.series}_LSC_NONE

GenF002A.menu.xserial.generic=Enabled (generic 'Serial')
GenF002A.menu.xserial.none=Enabled (no generic 'Serial')
GenF002A.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF002A.menu.xserial.disabled=Disabled (no Serial support)
GenF002A.menu.xserial.disabled.build.xSerial=

# debug
GenF002A.menu.dbg.none=None
GenF002A.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF002A.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF002A.menu.dbg.enable_log=Core logs Enabled
GenF002A.menu.dbg.enable_log.build.flags.debug=
GenF002A.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF002A.menu.dbg.enable_all.build.flags.debug=-g

# optimize
GenF002A.menu.opt.osstd=Smallest (-Os default)
GenF002A.menu.opt.oslto=Smallest (-Os) with LTO
GenF002A.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF002A.menu.opt.o1std=Fast (-O1)
GenF002A.menu.opt.o1std.build.flags.optimize=-O1
GenF002A.menu.opt.o1lto=Fast (-O1) with LTO
GenF002A.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF002A.menu.opt.o2std=Faster (-O2)
GenF002A.menu.opt.o2std.build.flags.optimize=-O2
GenF002A.menu.opt.o2lto=Faster (-O2) with LTO
GenF002A.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF002A.menu.opt.o3std=Fastest (-O3)
GenF002A.menu.opt.o3std.build.flags.optimize=-O3
GenF002A.menu.opt.o3lto=Fastest (-O3) with LTO
GenF002A.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF002A.menu.opt.ogstd=Debug (-Og)
GenF002A.menu.opt.ogstd.build.flags.optimize=-Og
GenF002A.menu.opt.o0std=No Optimization (-O0)
GenF002A.menu.opt.o0std.build.flags.optimize=-O0

GenF002A.menu.SupplyVoltage.3V3=3.3V
GenF002A.menu.SupplyVoltage.3V3.build.sv_tmp=-DVDD_3V3
GenF002A.menu.SupplyVoltage.1V8=1.8V
GenF002A.menu.SupplyVoltage.3V3.build.sv_tmp=-DVDD_1V8
GenF002A.menu.SupplyVoltage.2V5=2.5V
GenF002A.menu.SupplyVoltage.3V3.build.sv_tmp=-DVDD_2V5
GenF002A.menu.SupplyVoltage.2V8=2.8V
GenF002A.menu.SupplyVoltage.3V3.build.sv_tmp=-DVDD_2V8
GenF002A.menu.SupplyVoltage.3V8=3.8V
GenF002A.menu.SupplyVoltage.3V3.build.sv_tmp=-DVDD_3V8
GenF002A.menu.SupplyVoltage.5V=5V
GenF002A.menu.SupplyVoltage.5V.build.sv_tmp=-DVDD_5V

