regimantas/Arduino-PY32/boards.txt
GenF002A.menu.BOR.unchanged=Unchanged
GenF002A.menu.BOR.unchanged.build.bor_flags=
GenF002A.menu.BOR.disabled=Disabled
GenF002A.menu.BOR.disabled.build.bor_flags=-DPY32_BOR_CONFIG=0
GenF002A.menu.BOR.bor17=1.7-1.8V
GenF002A.menu.BOR.bor17.build.bor_flags=-DPY32_BOR_CONFIG=1
GenF002A.menu.BOR.bor19=1.9-2.0V
GenF002A.menu.BOR.bor19.build.bor_flags=-DPY32_BOR_CONFIG=2
GenF002A.menu.BOR.bor21=2.1-2.2V
GenF002A.menu.BOR.bor21.build.bor_flags=-DPY32_BOR_CONFIG=3
GenF002A.menu.BOR.bor23=2.3-2.4V
GenF002A.menu.BOR.bor23.build.bor_flags=-DPY32_BOR_CONFIG=4
GenF002A.menu.BOR.bor25=2.5-2.6V
GenF002A.menu.BOR.bor25.build.bor_flags=-DPY32_BOR_CONFIG=5
GenF002A.menu.BOR.bor27=2.7-2.8V
GenF002A.menu.BOR.bor27.build.bor_flags=-DPY32_BOR_CONFIG=6
GenF002A.menu.BOR.bor29=2.9-3.0V
GenF002A.menu.BOR.bor29.build.bor_flags=-DPY32_BOR_CONFIG=7
GenF002A.menu.BOR.bor31=3.1-3.2V
GenF002A.menu.BOR.bor31.build.bor_flags=-DPY32_BOR_CONFIG=8

GenF002A.menu.BORWrite.skip=Do not write option bytes
GenF002A.menu.BORWrite.skip.build.bor_apply_flags=
GenF002A.menu.BORWrite.apply=Apply selected BOR at startup
GenF002A.menu.BORWrite.apply.build.bor_apply_flags=-DPY32_APPLY_BOR_OPTION_BYTES=1

# boot
GenF002A.menu.BootConnection.defaule=default isp circuit
GenF002A.menu.BootConnection.defaule.upload.boot=default_reset
GenF002A.menu.BootConnection.direct=direct connect
GenF002A.menu.BootConnection.direct.upload.boot=direct_connect

GenF002A.build.extra_flags={build.temp} -DF_CPU={build.f_cpu} {build.lsc_temp} {build.sv_tmp} {build.bor_flags} {build.bor_apply_flags}

GenF002A.menu.pnum.PY32F002Ax5=PY32F002Ax5
GenF002A.menu.pnum.PY32F002Ax5.upload.maximum_size=20480
GenF002A.menu.pnum.PY32F002Ax5.upload.maximum_data_size=3072
GenF002A.menu.pnum.PY32F002Ax5.build.board=PY32F002Ax5
GenF002A.menu.pnum.PY32F002Ax5.build.product_line=PY32F002Ax5
GenF002A.menu.pnum.PY32F002Ax5.build.variant=PY32F002Axx/PY32F002A_Base

###############################
# Generic PY32F040 Series
###############################

GenF040.name=Generic PY32F040 Series

GenF040.upload.maximum_size=0
GenF040.upload.maximum_data_size=0

GenF040.upload.tool=ArduinoPY32Flasher
GenF040.upload.tool.default=ArduinoPY32Flasher

GenF040.menu.upload_method.flasher=ArduinoPY32Flasher (Windows/Linux)
GenF040.menu.upload_method.flasher.upload.tool=ArduinoPY32Flasher
GenF040.menu.upload_method.flasher.upload.tool.default=ArduinoPY32Flasher
GenF040.menu.upload_method.airisp=AirISP (serial)
GenF040.menu.upload_method.airisp.upload.tool=AirISP
GenF040.menu.upload_method.airisp.upload.tool.default=AirISP

GenF040.build.core=arduino
GenF040.build.board=GenF040
GenF040.build.mcu=cortex-m0plus
GenF040.build.series=PY32F0xx
GenF040.build.cmsis_lib_gcc=arm_cortexM0l_math
GenF040.build.py_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenF040.build.drivers_include="-I{build.system.path}/Arduino-PY32F0xx-Drivers/{build.series}_HAL_Driver/Inc" "-I{build.system.path}/Arduino-PY32F0xx-Drivers/{build.series}_HAL_Driver/Src" "-I{build.system.path}/{build.series}" "-I{build.system.path}/Arduino-PY32F0xx-Drivers/CMSIS/Device/{build.series}/Include/" "-I{build.system.path}/Arduino-PY32F0xx-Drivers/CMSIS/Device/{build.series}/Source/gcc/" 

GenF040.menu.UploadSpeed.115200=115200
GenF040.menu.UploadSpeed.115200.upload.speed=115200
GenF040.menu.UploadSpeed.57600=57600
GenF040.menu.UploadSpeed.57600.upload.speed=57600
GenF040.menu.UploadSpeed.38400=38400
GenF040.menu.UploadSpeed.38400.upload.speed=38400
GenF040.menu.UploadSpeed.19200=19200
GenF040.menu.UploadSpeed.19200.upload.speed=19200
GenF040.menu.UploadSpeed.9600=9600
GenF040.menu.UploadSpeed.9600.upload.speed=9600
GenF040.menu.UploadSpeed.4800=4800
GenF040.menu.UploadSpeed.4800.upload.speed=4800
GenF040.menu.UploadSpeed.2400=2400
GenF040.menu.UploadSpeed.2400.upload.speed=2400
GenF040.menu.UploadSpeed.1200=1200
GenF040.menu.UploadSpeed.1200.upload.speed=1200

# HSI/HSE选择和主频
GenF040.menu.ClockSourceAndFrequency.HSI4M_HCLK4M=HSI 4Mhz, HCLK 4Mhz
GenF040.menu.ClockSourceAndFrequency.HSI4M_HCLK4M.build.temp=-D{build.series}_HSI_4M_HCLK_4M
GenF040.menu.ClockSourceAndFrequency.HSI4M_HCLK4M.build.f_cpu=4000000L

GenF040.menu.ClockSourceAndFrequency.HSI8M_HCLK8M=HSI 8Mhz, HCLK 8Mhz
GenF040.menu.ClockSourceAndFrequency.HSI8M_HCLK8M.build.temp=-D{build.series}_HSI_8M_HCLK_8M
GenF040.menu.ClockSourceAndFrequency.HSI8M_HCLK8M.build.f_cpu=8000000L

GenF040.menu.ClockSourceAndFrequency.HSI16M_HCLK16M=HSI 16Mhz, HCLK 16Mhz
GenF040.menu.ClockSourceAndFrequency.HSI16M_HCLK16M.build.temp=-D{build.series}_HSI_16M_HCLK_16M
GenF040.menu.ClockSourceAndFrequency.HSI16M_HCLK16M.build.f_cpu=16000000L

GenF040.menu.ClockSourceAndFrequency.HSI22_12M_HCLK22_12M=HSI 22.12Mhz, HCLK 22.12Mhz
GenF040.menu.ClockSourceAndFrequency.HSI22_12M_HCLK22_12M.build.temp=-D{build.series}_HSI_22_12M_HCLK_22_12M
GenF040.menu.ClockSourceAndFrequency.HSI22_12M_HCLK22_12M.build.f_cpu=22120000L

GenF040.menu.ClockSourceAndFrequency.HSI24M_HCLK24M=HSI 24Mhz, HCLK 24Mhz
GenF040.menu.ClockSourceAndFrequency.HSI24M_HCLK24M.build.temp=-D{build.series}_HSI_24M_HCLK_24M
GenF040.menu.ClockSourceAndFrequency.HSI24M_HCLK24M.build.f_cpu=24000000L

GenF040.menu.ClockSourceAndFrequency.HSI24M_HCLK72M=HSI 24Mhz, HCLK 72Mhz
GenF040.menu.ClockSourceAndFrequency.HSI24M_HCLK72M.build.temp=-D{build.series}_HSI_24M_HCLK_72M
GenF040.menu.ClockSourceAndFrequency.HSI24M_HCLK72M.build.f_cpu=72000000L

GenF040.menu.ClockSourceAndFrequency.HSE8M_HCLK8M=HSE 8Mhz, HCLK 8Mhz
GenF040.menu.ClockSourceAndFrequency.HSE8M_HCLK8M.build.temp=-D{build.series}_HSE_8M_HCLK_8M
GenF040.menu.ClockSourceAndFrequency.HSE8M_HCLK8M.build.f_cpu=8000000L

GenF040.menu.ClockSourceAndFrequency.HSE16M_HCLK16M=HSE 16Mhz, HCLK 16Mhz
GenF040.menu.ClockSourceAndFrequency.HSE16M_HCLK16M.build.temp=-D{build.series}_HSE_16M_HCLK_16M
GenF040.menu.ClockSourceAndFrequency.HSE16M_HCLK16M.build.f_cpu=16000000L

GenF040.menu.ClockSourceAndFrequency.HSE24M_HCLK24M=HSE 24Mhz, HCLK 24Mhz
GenF040.menu.ClockSourceAndFrequency.HSE24M_HCLK24M.build.temp=-D{build.series}_HSE_24M_HCLK_24M
GenF040.menu.ClockSourceAndFrequency.HSE24M_HCLK24M.build.f_cpu=24000000L

