regimantas/Arduino-PY32/boards.txt
GenF040.menu.ClockSourceAndFrequency.HSE24M_HCLK72M=HSE 24Mhz, HCLK 72Mhz
GenF040.menu.ClockSourceAndFrequency.HSE24M_HCLK72M.build.temp=-D{build.series}_HSE_24M_HCLK_72M
GenF040.menu.ClockSourceAndFrequency.HSE24M_HCLK72M.build.f_cpu=72000000L

GenF040.menu.ClockSourceAndFrequency.HSE32M_HCLK32M=HSE 32Mhz, HCLK 32Mhz
GenF040.menu.ClockSourceAndFrequency.HSE32M_HCLK32M.build.temp=-D{build.series}_HSE_32M_HCLK_32M
GenF040.menu.ClockSourceAndFrequency.HSE32M_HCLK32M.build.f_cpu=32000000L

GenF040.menu.LowSpeedClockSource.LSI=LSI 32.768Khz
GenF040.menu.LowSpeedClockSource.LSI.build.lsc_temp=-D{build.series}_LSC_LSI

GenF040.menu.LowSpeedClockSource.LSE=LSE 32.768Khz
GenF040.menu.LowSpeedClockSource.LSE.build.lsc_temp=-D{build.series}_LSC_LSE

GenF040.menu.LowSpeedClockSource.None=None
GenF040.menu.LowSpeedClockSource.None.build.lsc_temp=-D{build.series}_LSC_NONE

GenF040.menu.xserial.generic=Enabled (generic 'Serial')
GenF040.menu.xserial.none=Enabled (no generic 'Serial')
GenF040.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF040.menu.xserial.disabled=Disabled (no Serial support)
GenF040.menu.xserial.disabled.build.xSerial=

# debug
GenF040.menu.dbg.none=None
GenF040.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF040.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF040.menu.dbg.enable_log=Core logs Enabled
GenF040.menu.dbg.enable_log.build.flags.debug=
GenF040.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF040.menu.dbg.enable_all.build.flags.debug=-g

# optimize
GenF040.menu.opt.osstd=Smallest (-Os default)
GenF040.menu.opt.oslto=Smallest (-Os) with LTO
GenF040.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF040.menu.opt.o1std=Fast (-O1)
GenF040.menu.opt.o1std.build.flags.optimize=-O1
GenF040.menu.opt.o1lto=Fast (-O1) with LTO
GenF040.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF040.menu.opt.o2std=Faster (-O2)
GenF040.menu.opt.o2std.build.flags.optimize=-O2
GenF040.menu.opt.o2lto=Faster (-O2) with LTO
GenF040.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF040.menu.opt.o3std=Fastest (-O3)
GenF040.menu.opt.o3std.build.flags.optimize=-O3
GenF040.menu.opt.o3lto=Fastest (-O3) with LTO
GenF040.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF040.menu.opt.ogstd=Debug (-Og)
GenF040.menu.opt.ogstd.build.flags.optimize=-Og
GenF040.menu.opt.o0std=No Optimization (-O0)
GenF040.menu.opt.o0std.build.flags.optimize=-O0

GenF040.menu.SupplyVoltage.3V3=3.3V
GenF040.menu.SupplyVoltage.3V3.build.sv_tmp=-DVDD_3V3
GenF040.menu.SupplyVoltage.1V8=1.8V
GenF040.menu.SupplyVoltage.1V8.build.sv_tmp=-DVDD_1V8
GenF040.menu.SupplyVoltage.2V5=2.5V
GenF040.menu.SupplyVoltage.2V5.build.sv_tmp=-DVDD_2V5
GenF040.menu.SupplyVoltage.2V8=2.8V
GenF040.menu.SupplyVoltage.2V8.build.sv_tmp=-DVDD_2V8
GenF040.menu.SupplyVoltage.3V8=3.8V
GenF040.menu.SupplyVoltage.3V8.build.sv_tmp=-DVDD_3V8
GenF040.menu.SupplyVoltage.5V=5V
GenF040.menu.SupplyVoltage.5V.build.sv_tmp=-DVDD_5V

GenF040.menu.BOR.unchanged=Unchanged
GenF040.menu.BOR.unchanged.build.bor_flags=
GenF040.menu.BOR.disabled=Disabled
GenF040.menu.BOR.disabled.build.bor_flags=-DPY32_BOR_CONFIG=0
GenF040.menu.BOR.bor17=1.7-1.8V
GenF040.menu.BOR.bor17.build.bor_flags=-DPY32_BOR_CONFIG=1
GenF040.menu.BOR.bor19=1.9-2.0V
GenF040.menu.BOR.bor19.build.bor_flags=-DPY32_BOR_CONFIG=2
GenF040.menu.BOR.bor21=2.1-2.2V
GenF040.menu.BOR.bor21.build.bor_flags=-DPY32_BOR_CONFIG=3
GenF040.menu.BOR.bor23=2.3-2.4V
GenF040.menu.BOR.bor23.build.bor_flags=-DPY32_BOR_CONFIG=4
GenF040.menu.BOR.bor25=2.5-2.6V
GenF040.menu.BOR.bor25.build.bor_flags=-DPY32_BOR_CONFIG=5
GenF040.menu.BOR.bor27=2.7-2.8V
GenF040.menu.BOR.bor27.build.bor_flags=-DPY32_BOR_CONFIG=6
GenF040.menu.BOR.bor29=2.9-3.0V
GenF040.menu.BOR.bor29.build.bor_flags=-DPY32_BOR_CONFIG=7
GenF040.menu.BOR.bor31=3.1-3.2V
GenF040.menu.BOR.bor31.build.bor_flags=-DPY32_BOR_CONFIG=8

GenF040.menu.BORWrite.skip=Do not write option bytes
GenF040.menu.BORWrite.skip.build.bor_apply_flags=
GenF040.menu.BORWrite.apply=Apply selected BOR at startup
GenF040.menu.BORWrite.apply.build.bor_apply_flags=-DPY32_APPLY_BOR_OPTION_BYTES=1

# boot
GenF040.menu.BootConnection.defaule=default isp circuit
GenF040.menu.BootConnection.defaule.upload.boot=default_reset
GenF040.menu.BootConnection.direct=direct connect
GenF040.menu.BootConnection.direct.upload.boot=direct_connect

GenF040.build.extra_flags={build.temp} -DF_CPU={build.f_cpu} {build.lsc_temp} {build.sv_tmp} {build.bor_flags} {build.bor_apply_flags}

GenF040.menu.pnum.PY32F040x6=PY32F040x6 (32K Flash, 4K SRAM)
GenF040.menu.pnum.PY32F040x6.upload.maximum_size=32768
GenF040.menu.pnum.PY32F040x6.upload.maximum_data_size=4096
GenF040.menu.pnum.PY32F040x6.build.board=PY32F040x6
GenF040.menu.pnum.PY32F040x6.build.product_line=PY32F040x6
GenF040.menu.pnum.PY32F040x6.build.variant=PY32F040xx/PY32F040_Base

GenF040.menu.pnum.PY32F040x8=PY32F040x8 (64K Flash, 8K SRAM)
GenF040.menu.pnum.PY32F040x8.upload.maximum_size=65536
GenF040.menu.pnum.PY32F040x8.upload.maximum_data_size=8192
GenF040.menu.pnum.PY32F040x8.build.board=PY32F040x8
GenF040.menu.pnum.PY32F040x8.build.product_line=PY32F040x8
GenF040.menu.pnum.PY32F040x8.build.variant=PY32F040xx/PY32F040_Base

GenF040.menu.pnum.PY32F040x9=PY32F040x9 (96K Flash, 12K SRAM)
GenF040.menu.pnum.PY32F040x9.upload.maximum_size=98304
GenF040.menu.pnum.PY32F040x9.upload.maximum_data_size=12288
GenF040.menu.pnum.PY32F040x9.build.board=PY32F040x9
GenF040.menu.pnum.PY32F040x9.build.product_line=PY32F040x9
GenF040.menu.pnum.PY32F040x9.build.variant=PY32F040xx/PY32F040_Base

GenF040.menu.pnum.PY32F040xB=PY32F040xB (128K Flash, 16K SRAM)
GenF040.menu.pnum.PY32F040xB.upload.maximum_size=131072
GenF040.menu.pnum.PY32F040xB.upload.maximum_data_size=16384
GenF040.menu.pnum.PY32F040xB.build.board=PY32F040xB
GenF040.menu.pnum.PY32F040xB.build.product_line=PY32F040xB
GenF040.menu.pnum.PY32F040xB.build.variant=PY32F040xx/PY32F040_Base

GenF040.menu.pnum.PY32F040CxB=PY32F040CxB (128K Flash, 16K SRAM)
GenF040.menu.pnum.PY32F040CxB.upload.maximum_size=131072
GenF040.menu.pnum.PY32F040CxB.upload.maximum_data_size=16384
GenF040.menu.pnum.PY32F040CxB.build.board=PY32F040CxB
GenF040.menu.pnum.PY32F040CxB.build.product_line=PY32F040CxB
GenF040.menu.pnum.PY32F040CxB.build.variant=PY32F040xx/PY32F040_Base

GenF040.menu.pnum.PY32F040C1BT6=PY32F040C1BT6 (LQFP48, 128K Flash, 16K SRAM)
GenF040.menu.pnum.PY32F040C1BT6.upload.maximum_size=131072
GenF040.menu.pnum.PY32F040C1BT6.upload.maximum_data_size=16384
GenF040.menu.pnum.PY32F040C1BT6.build.board=PY32F040C1BT6
GenF040.menu.pnum.PY32F040C1BT6.build.product_line=PY32F040CxB
GenF040.menu.pnum.PY32F040C1BT6.build.variant=PY32F040xx/PY32F040_Base
